Revit 2026 API

# BuiltInFailuresSplitSketchBasedElementFailures Class

---

Failures related to the split sketched based element.

SystemObject Autodesk.Revit.DBBuiltInFailuresSplitSketchBasedElementFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SplitSketchBasedElementFailures
```
```vb
Public NotInheritable Class SplitSketchBasedElementFailures
```
```cpp
public ref class SplitSketchBasedElementFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SplitSketchBasedElementFailures = class end
```

The BuiltInFailuresSplitSketchBasedElementFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NotSplitValidRegions | The split failed. There may be a gap in the boundary loop or the sketch may be incomplete. |

#### Reference

Autodesk.Revit.DB Namespace